
### :robot: Terraform Report
---
##### Plan: `6` to add, `0` to change, `0` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # google_firestore_database.overlays-ds will be created
  + resource "google_firestore_database" "overlays-ds" {
      + app_engine_integration_mode       = (known after apply)
      + concurrency_mode                  = (known after apply)
      + create_time                       = (known after apply)
      + delete_protection_state           = (known after apply)
      + deletion_policy                   = "ABANDON"
      + earliest_version_time             = (known after apply)
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + key_prefix                        = (known after apply)
      + location_id                       = "us-central1"
      + name                              = "overlays-ds"
      + point_in_time_recovery_enablement = "POINT_IN_TIME_RECOVERY_DISABLED"
      + project                           = "maestro-intelligence"
      + type                              = "DATASTORE_MODE"
      + uid                               = (known after apply)
      + update_time                       = (known after apply)
      + version_retention_period          = (known after apply)
    }

  # google_firestore_database.overlays-fs will be created
  + resource "google_firestore_database" "overlays-fs" {
      + app_engine_integration_mode       = (known after apply)
      + concurrency_mode                  = (known after apply)
      + create_time                       = (known after apply)
      + delete_protection_state           = "DELETE_PROTECTION_ENABLED"
      + deletion_policy                   = "ABANDON"
      + earliest_version_time             = (known after apply)
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + key_prefix                        = (known after apply)
      + location_id                       = "us-central1"
      + name                              = "overlays-fs"
      + point_in_time_recovery_enablement = "POINT_IN_TIME_RECOVERY_DISABLED"
      + project                           = "maestro-intelligence"
      + type                              = "FIRESTORE_NATIVE"
      + uid                               = (known after apply)
      + update_time                       = (known after apply)
      + version_retention_period          = (known after apply)
    }

  # google_project_service.project_services["dataflow.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "maestro-intelligence"
      + service                    = "dataflow.googleapis.com"

      + timeouts {
          + create = "5m"
          + update = "10m"
        }
    }

  # google_project_service.project_services["firestore.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "maestro-intelligence"
      + service                    = "firestore.googleapis.com"

      + timeouts {
          + create = "5m"
          + update = "10m"
        }
    }

  # google_project_service.project_services["logging.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "maestro-intelligence"
      + service                    = "logging.googleapis.com"

      + timeouts {
          + create = "5m"
          + update = "10m"
        }
    }

  # google_project_service.project_services["monitoring.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "maestro-intelligence"
      + service                    = "monitoring.googleapis.com"

      + timeouts {
          + create = "5m"
          + update = "10m"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#12167634088`](https://github.com/lessthan3/personalization/actions/runs/12167634088) - commit e5dbbaba70b042a9390eba4e488133c09ab639ad
